use ershov_island

delete from occupant
delete from businessman

delete from craft
delete from house
delete from person

set identity_insert craft on
insert into craft
	(id_craft, name_craft, description) values
	(1, 'сбивание кокосов', 'не такое простое занятие, как может показаться'),
	(2, 'собирание ягод', NULL),
	(3, 'собирание трав', NULL),
	(4, 'изготовление посуды', NULL),
	(5, 'целительство', NULL),
	(6, 'изготовление красок', NULL),
	(7, 'ловля рыбы', NULL),
	(8, 'заготовка тростника', NULL),
	(9, 'выращивание табака', NULL),
	(10, 'плетение верёвок', NULL)
set identity_insert craft off

set identity_insert house on
insert into house (
	id_house,
	address,
	date_p,
	date_s,
	area
) values (
	1,
	'Красная, 1',
	'1800',
	'1899',
	100
), (
	2,
	'Красная, 2',
	'1850',
	'1950',
	110
), (
	3,
	'Красная, 3',
	'1919',
	NULL,
	100
), (
	4,
	'Зелёная, 1',
	'1960',
	NULL,
	110
), (
	5,
	'Зелёная, 2',
	'1970',
	NULL,
	150
), (
	6,
	'Зелёная, 3',
	'1980',
	NULL,
	140
), (
	7,
	'Зелёная, 4',
	'1990',
	NULL,
	100
), (
	8,
	'Синяя, 1',
	'2000',
	NULL,
	110
), (
	9,
	'Синяя, 2',
	'2002',
	NULL,
	200
), (
	10,
	'Синяя, 3',
	'2003',
	NULL,
	160
)
set identity_insert house off

set identity_insert person on
insert into person (
	id_person,
	surname,
	name,
	sex,
	date_r,
	date_d,
	father,
	mother
) values (
	1,
	'Арбузов',
	'Иван',
	1,
	'20.10.1995',
	NULL,
	'Арбузов Николай',
	'Арбузова Галина'
), (
	2,
	'Арбузов',
	'Николай',
	1,
	'20.01.1960',
	NULL,
	'Арбузов Анатолий',
	NULL
), (
	3,
	'Арбузова',
	'Галина',
	0,
	'30.01.1960',
	NULL,
	'Ленин Василий',
	'Ленина Анна'
), (
	4,
	'Арбузов',
	'Анатолий',
	1,
	'1.10.1899',
	'5.09.2005',
	NULL,
	NULL
), (
	5,
	'Ленин',
	'Василий',
	1,
	'14.07.1924',
	'5.08.2007',
	NULL,
	NULL
), (
	6,
	'Ленина',
	'Анна',
	0,
	'23.6.1920',
	'5.09.1995',
	NULL,
	NULL
), (
	7,
	'Долгов',
	'Владимир',
	1,
	'10.11.1995',
	NULL,
	NULL,
	NULL
), (
	8,
	'Метелёва',
	'Алиса',
	0,
	'6.10.1995',
	NULL,
	NULL,
	NULL
), (
	9,
	'Кадыров',
	'Рамзан',	
	1,
	'15.1.1970',
	NULL,
	NULL,
	NULL
), (
	10,
	'Иванова',
	'Анна',
	0,
	'29.04.1999',
	NULL,
	NULL,
	NULL
)
set identity_insert person off

insert into occupant values
	(1, 7, '20.10.1995', NULL),
	(2, 1, '03.08.1925', NULL),
	(3, 2, '22.03.1948', '11.06.1992'),
	(4, 3, '18.02.1957', '08.05.1967'),
	(6, 5, '28.02.1972', NULL),
	(7, 6, '11.06.1992', NULL),
	(8, 7, '14.06.1999', '17.09.2003'),
	(9, 1, '17.09.2001', '17.09.2002'),
	(9, 1, '17.09.2003', NULL)

insert into businessman values
	(1, 7, '20.10.1995', NULL, 'весело', 10),
	(1, 1, '20.10.1995', NULL, NULL, 0),
	(2, 1, '03.08.1925', NULL, 'деньги', 1),
	(2, 2, '03.08.1925', '03.08.1927', 'деньги', 1),
	(3, 2, '22.03.1948', '11.06.1992', 'сила', 2),
	(4, 3, '18.02.1957', '08.05.1967', 'власть', 0),
	(5, 4, '08.05.1967', NULL, 'влияние', 0),
	(6, 5, '28.02.1972', NULL, 'скука', 7),
	(7, 6, '11.06.1992', NULL, 'деньги', 4),
	(8, 7, '14.06.1999', '17.09.2003', 'почему бы и нет', 2),
	(9, 1, '17.09.2003', NULL, NULL, 12),
	(10, 1, '06.09.2012', NULL, NULL, 10)